//@ts-nocheck
"use client"
import React from 'react';

const Unicorns = () => {
  return (
    <div style={{ color: '#660033', backgroundImage: 'url("/unicorns/9.jpg")', padding: "20px", fontWeight: "bold"}}>
      <div style={{ backgroundImage: 'url("/unicorns/9.jpg")', textAlign: 'center' }}>
        <h1>ЕДИНОРОЖИКИ МИЛЫЕ</h1>
        <marquee behavior="alternate" direction="left" style={{ backgroundColor: '#ADD8E6' }}>
          &#10024;&#10024; &#10024; &#10024;&#6550; &#6653; &#7558; &#8104; &#8752; &#10024; &#10024; &#10024; &#6550; &#6653; &#7558; &#8104; &#8752; &#10024; &#10024; &#10024;&#10024; &#10024; &#10024;&#10024; &#10024; &#10024; &#6550; &#6653; &#7558; &#8104; &#8752;&#6550; &#6653; &#7558; &#8104; &#8752;&#10024; &#10024; &#10024;&#10024; &#10024;
        </marquee>

        <font color="#4B0082">Единороги. Миф или реальность?!</font> <span role="img" aria-label="Heart">❤️</span>
      </div>

      <p>
        <img src="/unicorns/4.gif" alt="Unicorn" align="right" />
        <b>
          <h3>
            Ученые из Северной Кореи объявили о том, что нашли доказательства существования единорога, чем немало
            всполошили общественность во всем мире. Всегда считалось, что лошадь-единорог – всего лишь вымышленный
            сказочный персонаж.
          </h3>
        </b>
      </p>

      <p>
        <span style={{ backgroundColor: '#ffccff' }}>
          Археологам удалось найти доказательства существования единорога, когда они обнаружили прямоугольную скалу с
          {/* eslint-disable-next-line react/no-unescaped-entities */}
          выгравированными словами "Логово единорога" в 200 метрах от храма Йонгмьонг в Пхеньяне. Эта находка перекликается с
          информацией в исторической книге 16-го века. В этой книге упоминается о том, что король Тонгмьонг ездил верхом на
          единороге. Храм служил местом отдыха для короля, в нем также располагалось специальное место для его коня.
          Есть предположения, что это сообщение - всего лишь пародия в ответ на сатирическую статью издания Onion. В
          {/* eslint-disable-next-line react/no-unescaped-entities */}
          статье говорилось о том, что лидер Северной Кореи Ким Чен Ын является "самым сексуальным мужчиной 2012 года".
        </span>
      </p>

      <img src="/unicorns/7.gif" alt="Unicorn" /><br />
      <a href="http://www.infoniac.ru/news/Sushestvuyut-li-nastoyashie-edinorogi.html">
        <img src="/unicorns/5.jpg" width="300" height="300" alt="Unicorn" /><br />
      </a>

      <p style={{fontSize: "22px"}}>
        Иногда его также называют «моноцеросом», хотя вообще-то это разные создания (моноцерос, судя по имени, более похож на
        риноцероса – носорога). Единорога часто изображают в виде коня, с единственным, но огромным отличием – большим рогом
        на голове, растущим прямо между глаз. К тому же, рогом немаленького размера, длинным и прямым, часто закрученным по
        спирали. Некоторые единороги похожи не на коней, а, скорее, на козлов с бородой. Изредка, очень редко, их
        изображают с крыльями, как у Пегаса. Единорогов считают могущественными созданиями способными ускользать от любых
        охотников, пытающихся их поймать. Они невероятно быстры, гораздо быстрее обычных лошадей, и способны драться с большой
        силой. Единорогам приходится сражаться за свою жизнь, потому что их рога чрезвычайно ценны из-за своей волшебной силы.
        Рог единорога может спасти при отравлении, а если его растереть в порошок, его можно использовать как афродизиак
        (печально, но рог носорога, по мифам, тоже обладает подобной силой, поэтому носорогов осталось так мало).
        Несмотря на свою свирепую натуру и таинственность, есть один верный способ поймать единорога – на девственницу! Если
        юная служанка окажется на пути единорога, он обязательно выйдет поздороваться. Если она сидит, единорог положит голову к
        ней на колени и заснёт. Эту идею часто используют, как аллегорию для изображения Христа и Девы Марии, а единорог
        превратился в символ веры.
      </p>

      <p style={{fontSize: "22px", margin: "10px 20px"}}>ПРИЧИНЫ ЛЮБИТЬ ЕДИНОРОГОВ</p>
      <ol style={{fontSize: "22px", listStyle:"inside"}}>
        <li style={{ color: '#aaffff' }}>ОНИ ПРЕКРАСНЫ</li>
        <li style={{ color: '#ccssff' }}>ОНИ ВОЛШЕБНЫ</li>
        <li style={{ color: '#ccffdd' }}>КРАСИВАЯ ГРИВА</li>
        <li style={{ color: '#ffcc66' }}>НЕОБЫЧНЫЙ РОГ</li>
      </ol>

      <script>
        {`
          alert("ЛЮБИШЬ ЕДИНОРОГОВ?! ТОГДА ТЫ ПО АДРЕСУ !");
        `}
      </script>

      <a href="#null" onClick={(e) => e.preventDefault()} onDoubleClick={() => {
        e.preventDefault()
        alert('кря')
      }
      }
      style={{color: "blue", fontSize: "22px"}}
      >
        тайное послание короля единорогов
      </a>

      <form>
        <button
          type="submit"
          // onClick={() => window.external.addFavorite('file:///P:/1-%D0%A2%D0%94%D0%90-25/%D0%9A%D0%BE%D0%BB%D0%BE%D0%BC%D0%B5%D0%B9%D1%86%D0%B5%D0%B2%D0%B0/%D0%98%D0%BD%D1%84%D0%BE%D1%80%D0%BC.%20%D0%A2%D0%B5%D1%85/%D0%9F%D1%80%D0%BE%D0%B1%D0%BD%D0%B8%D0%BA%20%D1%81%D0%B0%D0%B9%D1%82%D0%B0/ndex.html', ' ЕДИНОРОЖИКИ МИЛЫЕ ')}
          onClick={() => {
            console.log("something do")
          }}
          onMouseOver={(e) => (e.target.style.color = 'red')}
          onMouseOut={(e) => (e.target.style.color = 'black')}
        >
          <img src="/unicorns/4.jpg" width="40" height="40" alt="Unicorn" align="middle" />
          <span style={{ fontSize: '12pt' }}>загадать желание</span>
        </button>
      </form>

      <table>
        <tr>
          <td bgcolor="#ccffdd">ФАКТЫ О ЕДИНОРОГАХ</td>
          <td bgcolor="#ccffdd">1 ИХ ГРИВА ВОЛШЕБНА</td>
          <td bgcolor="#ccffdd">2 РОГ МОЖЕТ СЛУЖИТЬ ПРОТИОЯДИЕМ</td>
          <td bgcolor="#ccffdd">3 СЛЕЗЫ ПОДАРЯТ ВЕЧНУЮ ЖИЗНЬ</td>
        </tr>
        <tr>
          <td bgcolor="#9999ff">КАК ИХ НАЙТИ</td>
          <td bgcolor="#9999ff">1 В ВОЛШЕБНОМ ЛЕСУ</td>
          <td bgcolor="#9999ff">2 НОЧЬЮ ВОЗЛЕ СЕРЕБРЯННОГО ОЗЕРА</td>
          <td bgcolor="#9999ff">3 МЛЕННО ПРЗЫВАТЬ ЕГО В ГОРАХ</td>
        </tr>
      </table>

      <a href="http://www.infoniac.ru/news/Sushestvuyut-li-nastoyashie-edinorogi.html">ОНИ ЕСТЬ</a>
      <br />
      <a href="mailto:123@mail.ru">Почтовый ящик</a>
    </div>
  );
};

export default Unicorns;